Documents/УборкаМестСодержанияСписком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УборкаМестСодержанияСписком</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ГрафикУборкиМестСодержанияПодопечных</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиРасходников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расходники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Расходник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Расходники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Кошки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кошка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиРасходников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиРасходников</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Расходник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Расходники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ГрафикУборкиМестСодержанияПодопечных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГрафикУборкиМестСодержанияПодопечных</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Убрано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УборкаМестСодержанияСписком/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
		// регистр ОстаткиРасходников Расход
	Движения.ОстаткиРасходников.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УборкаМестСодержанияСпискомРасходники.Расходник КАК Расходник,
		|	СУММА(УборкаМестСодержанияСпискомРасходники.Количество) КАК Количество,
		|	&Период КАК Период,
		|	&ВидДвижения КАК ВидДвижения
		|ПОМЕСТИТЬ ТЧСписокРасходников
		|ИЗ
		|	Документ.УборкаМестСодержанияСписком.Расходники КАК УборкаМестСодержанияСпискомРасходники
		|ГДЕ
		|	УборкаМестСодержанияСпискомРасходники.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	УборкаМестСодержанияСпискомРасходники.Расходник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Расходник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧСписокРасходников.ВидДвижения КАК ВидДвижения,
		|	ТЧСписокРасходников.Количество КАК Количество,
		|	ТЧСписокРасходников.Период КАК Период,
		|	ТЧСписокРасходников.Расходник КАК Расходник
		|ИЗ
		|	ТЧСписокРасходников КАК ТЧСписокРасходников";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Период", Дата);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДвижений = РезультатЗапроса.Выгрузить();
	
	Движения.ОстаткиРасходников.Загрузить(ТаблицаДвижений);
	
	Движения.ОстаткиРасходников.БлокироватьДляИзменения = Истина;

	Движения.Записать();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиРасходниковОстатки.Расходник КАК Расходник,
		|	ОстаткиРасходниковОстатки.Расходник.Представление КАК РасходникПредставление,
		|	ОстаткиРасходниковОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиРасходниковОстатки.Расходник.ЕдиницаИзмерения КАК РасходникЕдиницаИзмерения
		|ИЗ
		|	РегистрНакопления.ОстаткиРасходников.Остатки(
		|			&ДатаОстатков,
		|			Расходник В
		|				(ВЫБРАТЬ
		|					ТЧСписокРасходников.Расходник КАК Расходник
		|				ИЗ
		|					ТЧСписокРасходников КАК ТЧСписокРасходников)) КАК ОстаткиРасходниковОстатки
		|ГДЕ
		|	ОстаткиРасходниковОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	
	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю;
			ТекстСообщения = СтрШаблон("Недостаточно расходников %1, не хватает: %2 %3", 
										Выборка.РасходникПредставление, -Выборка.КоличествоОстаток, Выборка.РасходникЕдиницаИзмерения);
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// регистр ГрафикУборкиМестСодержанияПодопечных
	Движения.ГрафикУборкиМестСодержанияПодопечных.Записывать = Истина;
	Для Каждого ТекСтрокаКошки Из Кошки Цикл
		Движение = Движения.ГрафикУборкиМестСодержанияПодопечных.Добавить();
		Движение.Период = Дата;
		Движение.Кошка = ТекСтрокаКошки.Кошка;
		Движение.Убрано = Истина;
	КонецЦикла;

КонецПроцедуры
